import numpy as np
a = np.array([3, 1, 2, 4, 6, 1])
print(np.argmax(a))

a = np.array([[1, 5, 5, 2],
              [9, 6, 2, 8],
              [3, 7, 9, 1]])
print(np.argmax(a, axis=0))
'''
为了描述方便,a就表示这个二维数组.np.argmax(a, axis=0)的含义是a[0][j],a[1][j],a[2]j中最大值的索引.
从a[0][j]开始,最大值索引最初为(0,0,0,0),拿a[0][j]和a[1][j]作比较,9大于1,6大于5,8大于2,所以最大值索引由(0,0,0,0)更新为(1,1,0,1),
再和a[2][j]作比较,7大于6,9大于5所以更新为(1,2,2,1).
'''

a = np.array([[1, 5, 5, 2],
              [9, 6, 2, 8],
              [3, 7, 9, 1]])
print(np.argmax(a, axis=1))
'''
np.argmax(a, axis=1)的含义是a[i][0],a[i][1],a[i][2],a[i]3中最大值的索引.
从a[i][0]开始,a[i][0]对应的索引为(0,0,0),先假定它就是最大值索引(思路和上节简单例子完全一致)拿a[i][0]和a[i][1]作比较,5大于1,7大于3所以最大值索引由(0,0,0)更新为(1,0,1),
再和a[i][2]作比较,9大于7,更新为(1,0,2),
再和a[i][3]作比较,不用更新,最终值为(1,0,2)
'''